bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/uart_reg.h
/* 0x1C : uart_sw_mode */
#define UART_SW_MODE_OFFSET                                     (0x1C)
#define UART_CR_UTX_TXD_SW_MODE                                 UART_CR_UTX_TXD_SW_MODE
#define UART_CR_UTX_TXD_SW_MODE_POS                             (0U)
#define UART_CR_UTX_TXD_SW_MODE_LEN                             (1U)
#define UART_CR_UTX_TXD_SW_MODE_MSK                             (((1U<<UART_CR_UTX_TXD_SW_MODE_LEN)-1)<<UART_CR_UTX_TXD_SW_MODE_POS)
#define UART_CR_UTX_TXD_SW_MODE_UMSK                            (~(((1U<<UART_CR_UTX_TXD_SW_MODE_LEN)-1)<<UART_CR_UTX_TXD_SW_MODE_POS))
#define UART_CR_UTX_TXD_SW_VAL                                  UART_CR_UTX_TXD_SW_VAL
#define UART_CR_UTX_TXD_SW_VAL_POS                              (1U)
#define UART_CR_UTX_TXD_SW_VAL_LEN                              (1U)
#define UART_CR_UTX_TXD_SW_VAL_MSK                              (((1U<<UART_CR_UTX_TXD_SW_VAL_LEN)-1)<<UART_CR_UTX_TXD_SW_VAL_POS)
#define UART_CR_UTX_TXD_SW_VAL_UMSK                             (~(((1U<<UART_CR_UTX_TXD_SW_VAL_LEN)-1)<<UART_CR_UTX_TXD_SW_VAL_POS))
#define UART_CR_URX_RTS_SW_MODE                                 UART_CR_URX_RTS_SW_MODE
#define UART_CR_URX_RTS_SW_MODE_POS                             (2U)
#define UART_CR_URX_RTS_SW_MODE_LEN                             (1U)
#define UART_CR_URX_RTS_SW_MODE_MSK                             (((1U<<UART_CR_URX_RTS_SW_MODE_LEN)-1)<<UART_CR_URX_RTS_SW_MODE_POS)
#define UART_CR_URX_RTS_SW_MODE_UMSK                            (~(((1U<<UART_CR_URX_RTS_SW_MODE_LEN)-1)<<UART_CR_URX_RTS_SW_MODE_POS))
#define UART_CR_URX_RTS_SW_VAL                                  UART_CR_URX_RTS_SW_VAL
#define UART_CR_URX_RTS_SW_VAL_POS                              (3U)
#define UART_CR_URX_RTS_SW_VAL_LEN                              (1U)
#define UART_CR_URX_RTS_SW_VAL_MSK                              (((1U<<UART_CR_URX_RTS_SW_VAL_LEN)-1)<<UART_CR_URX_RTS_SW_VAL_POS)
#define UART_CR_URX_RTS_SW_VAL_UMSK                             (~(((1U<<UART_CR_URX_RTS_SW_VAL_LEN)-1)<<UART_CR_URX_RTS_SW_VAL_POS))

/* 0x20 : UART interrupt status */
#define UART_INT_STS_OFFSET                                     (0x20)
#define UART_UTX_END_INT                                        UART_UTX_END_INT
#define UART_UTX_END_INT_POS                                    (0U)
#define UART_UTX_END_INT_LEN                                    (1U)
#define UART_UTX_END_INT_MSK                                    (((1U<<UART_UTX_END_INT_LEN)-1)<<UART_UTX_END_INT_POS)
#define UART_UTX_END_INT_UMSK                                   (~(((1U<<UART_UTX_END_INT_LEN)-1)<<UART_UTX_END_INT_POS))
#define UART_URX_END_INT                                        UART_URX_END_INT
#define UART_URX_END_INT_POS                                    (1U)
#define UART_URX_END_INT_LEN                                    (1U)
#define UART_URX_END_INT_MSK                                    (((1U<<UART_URX_END_INT_LEN)-1)<<UART_URX_END_INT_POS)
#define UART_URX_END_INT_UMSK                                   (~(((1U<<UART_URX_END_INT_LEN)-1)<<UART_URX_END_INT_POS))
#define UART_UTX_FRDY_INT                                       UART_UTX_FRDY_INT
#define UART_UTX_FRDY_INT_POS                                   (2U)
#define UART_UTX_FRDY_INT_LEN                                   (1U)
#define UART_UTX_FRDY_INT_MSK                                   (((1U<<UART_UTX_FRDY_INT_LEN)-1)<<UART_UTX_FRDY_INT_POS)
#define UART_UTX_FRDY_INT_UMSK                                  (~(((1U<<UART_UTX_FRDY_INT_LEN)-1)<<UART_UTX_FRDY_INT_POS))
#define UART_URX_FRDY_INT                                       UART_URX_FRDY_INT
#define UART_URX_FRDY_INT_POS                                   (3U)
#define UART_URX_FRDY_INT_LEN                                   (1U)
#define UART_URX_FRDY_INT_MSK                                   (((1U<<UART_URX_FRDY_INT_LEN)-1)<<UART_URX_FRDY_INT_POS)
#define UART_URX_FRDY_INT_UMSK                                  (~(((1U<<UART_URX_FRDY_INT_LEN)-1)<<UART_URX_FRDY_INT_POS))
#define UART_URX_RTO_INT                                        UART_URX_RTO_INT
#define UART_URX_RTO_INT_POS                                    (4U)
#define UART_URX_RTO_INT_LEN                                    (1U)
#define UART_URX_RTO_INT_MSK                                    (((1U<<UART_URX_RTO_INT_LEN)-1)<<UART_URX_RTO_INT_POS)
#define UART_URX_RTO_INT_UMSK                                   (~(((1U<<UART_URX_RTO_INT_LEN)-1)<<UART_URX_RTO_INT_POS))
#define UART_URX_PCE_INT                                        UART_URX_PCE_INT
#define UART_URX_PCE_INT_POS                                    (5U)
#define UART_URX_PCE_INT_LEN                                    (1U)
#define UART_URX_PCE_INT_MSK                                    (((1U<<UART_URX_PCE_INT_LEN)-1)<<UART_URX_PCE_INT_POS)
#define UART_URX_PCE_INT_UMSK                                   (~(((1U<<UART_URX_PCE_INT_LEN)-1)<<UART_URX_PCE_INT_POS))
#define UART_UTX_FER_INT                                        UART_UTX_FER_INT
#define UART_UTX_FER_INT_POS                                    (6U)
#define UART_UTX_FER_INT_LEN                                    (1U)
#define UART_UTX_FER_INT_MSK                                    (((1U<<UART_UTX_FER_INT_LEN)-1)<<UART_UTX_FER_INT_POS)
#define UART_UTX_FER_INT_UMSK                                   (~(((1U<<UART_UTX_FER_INT_LEN)-1)<<UART_UTX_FER_INT_POS))
#define UART_URX_FER_INT                                        UART_URX_FER_INT
#define UART_URX_FER_INT_POS                                    (7U)
#define UART_URX_FER_INT_LEN                                    (1U)
#define UART_URX_FER_INT_MSK                                    (((1U<<UART_URX_FER_INT_LEN)-1)<<UART_URX_FER_INT_POS)
#define UART_URX_FER_INT_UMSK                                   (~(((1U<<UART_URX_FER_INT_LEN)-1)<<UART_URX_FER_INT_POS))
#define UART_URX_LSE_INT                                        UART_URX_LSE_INT
#define UART_URX_LSE_INT_POS                                    (8U)
#define UART_URX_LSE_INT_LEN                                    (1U)
#define UART_URX_LSE_INT_MSK                                    (((1U<<UART_URX_LSE_INT_LEN)-1)<<UART_URX_LSE_INT_POS)
#define UART_URX_LSE_INT_UMSK                                   (~(((1U<<UART_URX_LSE_INT_LEN)-1)<<UART_URX_LSE_INT_POS))
#define UART_URX_BCR_INT                                        UART_URX_BCR_INT
#define UART_URX_BCR_INT_POS                                    (9U)
#define UART_URX_BCR_INT_LEN                                    (1U)
#define UART_URX_BCR_INT_MSK                                    (((1U<<UART_URX_BCR_INT_LEN)-1)<<UART_URX_BCR_INT_POS)
#define UART_URX_BCR_INT_UMSK                                   (~(((1U<<UART_URX_BCR_INT_LEN)-1)<<UART_URX_BCR_INT_POS))
#define UART_URX_ADS_INT                                        UART_URX_ADS_INT
#define UART_URX_ADS_INT_POS                                    (10U)
#define UART_URX_ADS_INT_LEN                                    (1U)
#define UART_URX_ADS_INT_MSK                                    (((1U<<UART_URX_ADS_INT_LEN)-1)<<UART_URX_ADS_INT_POS)
#define UART_URX_ADS_INT_UMSK                                   (~(((1U<<UART_URX_ADS_INT_LEN)-1)<<UART_URX_ADS_INT_POS))
#define UART_URX_AD5_INT                                        UART_URX_AD5_INT
#define UART_URX_AD5_INT_POS                                    (11U)
#define UART_URX_AD5_INT_LEN                                    (1U)
#define UART_URX_AD5_INT_MSK                                    (((1U<<UART_URX_AD5_INT_LEN)-1)<<UART_URX_AD5_INT_POS)
#define UART_URX_AD5_INT_UMSK                                   (~(((1U<<UART_URX_AD5_INT_LEN)-1)<<UART_URX_AD5_INT_POS))

/* 0x24 : UART interrupt mask */
#define UART_INT_MASK_OFFSET                                    (0x24)
#define UART_CR_UTX_END_MASK                                    UART_CR_UTX_END_MASK
#define UART_CR_UTX_END_MASK_POS                                (0U)
#define UART_CR_UTX_END_MASK_LEN                                (1U)
#define UART_CR_UTX_END_MASK_MSK                                (((1U<<UART_CR_UTX_END_MASK_LEN)-1)<<UART_CR_UTX_END_MASK_POS)
#define UART_CR_UTX_END_MASK_UMSK                               (~(((1U<<UART_CR_UTX_END_MASK_LEN)-1)<<UART_CR_UTX_END_MASK_POS))
#define UART_CR_URX_END_MASK                                    UART_CR_URX_END_MASK
#define UART_CR_URX_END_MASK_POS                                (1U)
#define UART_CR_URX_END_MASK_LEN                                (1U)
#define UART_CR_URX_END_MASK_MSK                                (((1U<<UART_CR_URX_END_MASK_LEN)-1)<<UART_CR_URX_END_MASK_POS)
#define UART_CR_URX_END_MASK_UMSK                               (~(((1U<<UART_CR_URX_END_MASK_LEN)-1)<<UART_CR_URX_END_MASK_POS))
#define UART_CR_UTX_FRDY_MASK                                   UART_CR_UTX_FRDY_MASK
#define UART_CR_UTX_FRDY_MASK_POS                               (2U)
#define UART_CR_UTX_FRDY_MASK_LEN                               (1U)
#define UART_CR_UTX_FRDY_MASK_MSK                               (((1U<<UART_CR_UTX_FRDY_MASK_LEN)-1)<<UART_CR_UTX_FRDY_MASK_POS)
#define UART_CR_UTX_FRDY_MASK_UMSK                              (~(((1U<<UART_CR_UTX_FRDY_MASK_LEN)-1)<<UART_CR_UTX_FRDY_MASK_POS))
#define UART_CR_URX_FRDY_MASK                                   UART_CR_URX_FRDY_MASK
#define UART_CR_URX_FRDY_MASK_POS                               (3U)
#define UART_CR_URX_FRDY_MASK_LEN                               (1U)
#define UART_CR_URX_FRDY_MASK_MSK                               (((1U<<UART_CR_URX_FRDY_MASK_LEN)-1)<<UART_CR_URX_FRDY_MASK_POS)
#define UART_CR_URX_FRDY_MASK_UMSK                              (~(((1U<<UART_CR_URX_FRDY_MASK_LEN)-1)<<UART_CR_URX_FRDY_MASK_POS))
#define UART_CR_URX_RTO_MASK                                    UART_CR_URX_RTO_MASK
#define UART_CR_URX_RTO_MASK_POS                                (4U)
#define UART_CR_URX_RTO_MASK_LEN                                (1U)
#define UART_CR_URX_RTO_MASK_MSK                                (((1U<<UART_CR_URX_RTO_MASK_LEN)-1)<<UART_CR_URX_RTO_MASK_POS)
#define UART_CR_URX_RTO_MASK_UMSK                               (~(((1U<<UART_CR_URX_RTO_MASK_LEN)-1)<<UART_CR_URX_RTO_MASK_POS))
#define UART_CR_URX_PCE_MASK                                    UART_CR_URX_PCE_MASK
#define UART_CR_URX_PCE_MASK_POS                                (5U)
#define UART_CR_URX_PCE_MASK_LEN                                (1U)
#define UART_CR_URX_PCE_MASK_MSK                                (((1U<<UART_CR_URX_PCE_MASK_LEN)-1)<<UART_CR_URX_PCE_MASK_POS)
#define UART_CR_URX_PCE_MASK_UMSK                               (~(((1U<<UART_CR_URX_PCE_MASK_LEN)-1)<<UART_CR_URX_PCE_MASK_POS))
#define UART_CR_UTX_FER_MASK                                    UART_CR_UTX_FER_MASK
#define UART_CR_UTX_FER_MASK_POS                                (6U)
#define UART_CR_UTX_FER_MASK_LEN                                (1U)
#define UART_CR_UTX_FER_MASK_MSK                                (((1U<<UART_CR_UTX_FER_MASK_LEN)-1)<<UART_CR_UTX_FER_MASK_POS)
#define UART_CR_UTX_FER_MASK_UMSK                               (~(((1U<<UART_CR_UTX_FER_MASK_LEN)-1)<<UART_CR_UTX_FER_MASK_POS))
#define UART_CR_URX_FER_MASK                                    UART_CR_URX_FER_MASK
#define UART_CR_URX_FER_MASK_POS                                (7U)
#define UART_CR_URX_FER_MASK_LEN                                (1U)
#define UART_CR_URX_FER_MASK_MSK                                (((1U<<UART_CR_URX_FER_MASK_LEN)-1)<<UART_CR_URX_FER_MASK_POS)
#define UART_CR_URX_FER_MASK_UMSK                               (~(((1U<<UART_CR_URX_FER_MASK_LEN)-1)<<UART_CR_URX_FER_MASK_POS))
#define UART_CR_URX_LSE_MASK                                    UART_CR_URX_LSE_MASK
#define UART_CR_URX_LSE_MASK_POS                                (8U)
#define UART_CR_URX_LSE_MASK_LEN                                (1U)
#define UART_CR_URX_LSE_MASK_MSK                                (((1U<<UART_CR_URX_LSE_MASK_LEN)-1)<<UART_CR_URX_LSE_MASK_POS)
#define UART_CR_URX_LSE_MASK_UMSK                               (~(((1U<<UART_CR_URX_LSE_MASK_LEN)-1)<<UART_CR_URX_LSE_MASK_POS))
#define UART_CR_URX_BCR_MASK                                    UART_CR_URX_BCR_MASK
#define UART_CR_URX_BCR_MASK_POS                                (9U)
#define UART_CR_URX_BCR_MASK_LEN                                (1U)
#define UART_CR_URX_BCR_MASK_MSK                                (((1U<<UART_CR_URX_BCR_MASK_LEN)-1)<<UART_CR_URX_BCR_MASK_POS)
#define UART_CR_URX_BCR_MASK_UMSK                               (~(((1U<<UART_CR_URX_BCR_MASK_LEN)-1)<<UART_CR_URX_BCR_MASK_POS))
#define UART_CR_URX_ADS_MASK                                    UART_CR_URX_ADS_MASK
#define UART_CR_URX_ADS_MASK_POS                                (10U)
#define UART_CR_URX_ADS_MASK_LEN                                (1U)
#define UART_CR_URX_ADS_MASK_MSK                                (((1U<<UART_CR_URX_ADS_MASK_LEN)-1)<<UART_CR_URX_ADS_MASK_POS)
#define UART_CR_URX_ADS_MASK_UMSK                               (~(((1U<<UART_CR_URX_ADS_MASK_LEN)-1)<<UART_CR_URX_ADS_MASK_POS))
#define UART_CR_URX_AD5_MASK                                    UART_CR_URX_AD5_MASK
#define UART_CR_URX_AD5_MASK_POS                                (11U)
#define UART_CR_URX_AD5_MASK_LEN                                (1U)
#define UART_CR_URX_AD5_MASK_MSK                                (((1U<<UART_CR_URX_AD5_MASK_LEN)-1)<<UART_CR_URX_AD5_MASK_POS)
#define UART_CR_URX_AD5_MASK_UMSK                               (~(((1U<<UART_CR_URX_AD5_MASK_LEN)-1)<<UART_CR_URX_AD5_MASK_POS))

