bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/uart_reg.h
/* 0x28 : UART interrupt clear */
#define UART_INT_CLEAR_OFFSET                                   (0x28)
#define UART_CR_UTX_END_CLR                                     UART_CR_UTX_END_CLR
#define UART_CR_UTX_END_CLR_POS                                 (0U)
#define UART_CR_UTX_END_CLR_LEN                                 (1U)
#define UART_CR_UTX_END_CLR_MSK                                 (((1U<<UART_CR_UTX_END_CLR_LEN)-1)<<UART_CR_UTX_END_CLR_POS)
#define UART_CR_UTX_END_CLR_UMSK                                (~(((1U<<UART_CR_UTX_END_CLR_LEN)-1)<<UART_CR_UTX_END_CLR_POS))
#define UART_CR_URX_END_CLR                                     UART_CR_URX_END_CLR
#define UART_CR_URX_END_CLR_POS                                 (1U)
#define UART_CR_URX_END_CLR_LEN                                 (1U)
#define UART_CR_URX_END_CLR_MSK                                 (((1U<<UART_CR_URX_END_CLR_LEN)-1)<<UART_CR_URX_END_CLR_POS)
#define UART_CR_URX_END_CLR_UMSK                                (~(((1U<<UART_CR_URX_END_CLR_LEN)-1)<<UART_CR_URX_END_CLR_POS))
#define UART_CR_URX_RTO_CLR                                     UART_CR_URX_RTO_CLR
#define UART_CR_URX_RTO_CLR_POS                                 (4U)
#define UART_CR_URX_RTO_CLR_LEN                                 (1U)
#define UART_CR_URX_RTO_CLR_MSK                                 (((1U<<UART_CR_URX_RTO_CLR_LEN)-1)<<UART_CR_URX_RTO_CLR_POS)
#define UART_CR_URX_RTO_CLR_UMSK                                (~(((1U<<UART_CR_URX_RTO_CLR_LEN)-1)<<UART_CR_URX_RTO_CLR_POS))
#define UART_CR_URX_PCE_CLR                                     UART_CR_URX_PCE_CLR
#define UART_CR_URX_PCE_CLR_POS                                 (5U)
#define UART_CR_URX_PCE_CLR_LEN                                 (1U)
#define UART_CR_URX_PCE_CLR_MSK                                 (((1U<<UART_CR_URX_PCE_CLR_LEN)-1)<<UART_CR_URX_PCE_CLR_POS)
#define UART_CR_URX_PCE_CLR_UMSK                                (~(((1U<<UART_CR_URX_PCE_CLR_LEN)-1)<<UART_CR_URX_PCE_CLR_POS))
#define UART_CR_URX_LSE_CLR                                     UART_CR_URX_LSE_CLR
#define UART_CR_URX_LSE_CLR_POS                                 (8U)
#define UART_CR_URX_LSE_CLR_LEN                                 (1U)
#define UART_CR_URX_LSE_CLR_MSK                                 (((1U<<UART_CR_URX_LSE_CLR_LEN)-1)<<UART_CR_URX_LSE_CLR_POS)
#define UART_CR_URX_LSE_CLR_UMSK                                (~(((1U<<UART_CR_URX_LSE_CLR_LEN)-1)<<UART_CR_URX_LSE_CLR_POS))
#define UART_CR_URX_BCR_CLR                                     UART_CR_URX_BCR_CLR
#define UART_CR_URX_BCR_CLR_POS                                 (9U)
#define UART_CR_URX_BCR_CLR_LEN                                 (1U)
#define UART_CR_URX_BCR_CLR_MSK                                 (((1U<<UART_CR_URX_BCR_CLR_LEN)-1)<<UART_CR_URX_BCR_CLR_POS)
#define UART_CR_URX_BCR_CLR_UMSK                                (~(((1U<<UART_CR_URX_BCR_CLR_LEN)-1)<<UART_CR_URX_BCR_CLR_POS))
#define UART_CR_URX_ADS_CLR                                     UART_CR_URX_ADS_CLR
#define UART_CR_URX_ADS_CLR_POS                                 (10U)
#define UART_CR_URX_ADS_CLR_LEN                                 (1U)
#define UART_CR_URX_ADS_CLR_MSK                                 (((1U<<UART_CR_URX_ADS_CLR_LEN)-1)<<UART_CR_URX_ADS_CLR_POS)
#define UART_CR_URX_ADS_CLR_UMSK                                (~(((1U<<UART_CR_URX_ADS_CLR_LEN)-1)<<UART_CR_URX_ADS_CLR_POS))
#define UART_CR_URX_AD5_CLR                                     UART_CR_URX_AD5_CLR
#define UART_CR_URX_AD5_CLR_POS                                 (11U)
#define UART_CR_URX_AD5_CLR_LEN                                 (1U)
#define UART_CR_URX_AD5_CLR_MSK                                 (((1U<<UART_CR_URX_AD5_CLR_LEN)-1)<<UART_CR_URX_AD5_CLR_POS)
#define UART_CR_URX_AD5_CLR_UMSK                                (~(((1U<<UART_CR_URX_AD5_CLR_LEN)-1)<<UART_CR_URX_AD5_CLR_POS))

/* 0x2C : UART interrupt enable */
#define UART_INT_EN_OFFSET                                      (0x2C)
#define UART_CR_UTX_END_EN                                      UART_CR_UTX_END_EN
#define UART_CR_UTX_END_EN_POS                                  (0U)
#define UART_CR_UTX_END_EN_LEN                                  (1U)
#define UART_CR_UTX_END_EN_MSK                                  (((1U<<UART_CR_UTX_END_EN_LEN)-1)<<UART_CR_UTX_END_EN_POS)
#define UART_CR_UTX_END_EN_UMSK                                 (~(((1U<<UART_CR_UTX_END_EN_LEN)-1)<<UART_CR_UTX_END_EN_POS))
#define UART_CR_URX_END_EN                                      UART_CR_URX_END_EN
#define UART_CR_URX_END_EN_POS                                  (1U)
#define UART_CR_URX_END_EN_LEN                                  (1U)
#define UART_CR_URX_END_EN_MSK                                  (((1U<<UART_CR_URX_END_EN_LEN)-1)<<UART_CR_URX_END_EN_POS)
#define UART_CR_URX_END_EN_UMSK                                 (~(((1U<<UART_CR_URX_END_EN_LEN)-1)<<UART_CR_URX_END_EN_POS))
#define UART_CR_UTX_FRDY_EN                                     UART_CR_UTX_FRDY_EN
#define UART_CR_UTX_FRDY_EN_POS                                 (2U)
#define UART_CR_UTX_FRDY_EN_LEN                                 (1U)
#define UART_CR_UTX_FRDY_EN_MSK                                 (((1U<<UART_CR_UTX_FRDY_EN_LEN)-1)<<UART_CR_UTX_FRDY_EN_POS)
#define UART_CR_UTX_FRDY_EN_UMSK                                (~(((1U<<UART_CR_UTX_FRDY_EN_LEN)-1)<<UART_CR_UTX_FRDY_EN_POS))
#define UART_CR_URX_FRDY_EN                                     UART_CR_URX_FRDY_EN
#define UART_CR_URX_FRDY_EN_POS                                 (3U)
#define UART_CR_URX_FRDY_EN_LEN                                 (1U)
#define UART_CR_URX_FRDY_EN_MSK                                 (((1U<<UART_CR_URX_FRDY_EN_LEN)-1)<<UART_CR_URX_FRDY_EN_POS)
#define UART_CR_URX_FRDY_EN_UMSK                                (~(((1U<<UART_CR_URX_FRDY_EN_LEN)-1)<<UART_CR_URX_FRDY_EN_POS))
#define UART_CR_URX_RTO_EN                                      UART_CR_URX_RTO_EN
#define UART_CR_URX_RTO_EN_POS                                  (4U)
#define UART_CR_URX_RTO_EN_LEN                                  (1U)
#define UART_CR_URX_RTO_EN_MSK                                  (((1U<<UART_CR_URX_RTO_EN_LEN)-1)<<UART_CR_URX_RTO_EN_POS)
#define UART_CR_URX_RTO_EN_UMSK                                 (~(((1U<<UART_CR_URX_RTO_EN_LEN)-1)<<UART_CR_URX_RTO_EN_POS))
#define UART_CR_URX_PCE_EN                                      UART_CR_URX_PCE_EN
#define UART_CR_URX_PCE_EN_POS                                  (5U)
#define UART_CR_URX_PCE_EN_LEN                                  (1U)
#define UART_CR_URX_PCE_EN_MSK                                  (((1U<<UART_CR_URX_PCE_EN_LEN)-1)<<UART_CR_URX_PCE_EN_POS)
#define UART_CR_URX_PCE_EN_UMSK                                 (~(((1U<<UART_CR_URX_PCE_EN_LEN)-1)<<UART_CR_URX_PCE_EN_POS))
#define UART_CR_UTX_FER_EN                                      UART_CR_UTX_FER_EN
#define UART_CR_UTX_FER_EN_POS                                  (6U)
#define UART_CR_UTX_FER_EN_LEN                                  (1U)
#define UART_CR_UTX_FER_EN_MSK                                  (((1U<<UART_CR_UTX_FER_EN_LEN)-1)<<UART_CR_UTX_FER_EN_POS)
#define UART_CR_UTX_FER_EN_UMSK                                 (~(((1U<<UART_CR_UTX_FER_EN_LEN)-1)<<UART_CR_UTX_FER_EN_POS))
#define UART_CR_URX_FER_EN                                      UART_CR_URX_FER_EN
#define UART_CR_URX_FER_EN_POS                                  (7U)
#define UART_CR_URX_FER_EN_LEN                                  (1U)
#define UART_CR_URX_FER_EN_MSK                                  (((1U<<UART_CR_URX_FER_EN_LEN)-1)<<UART_CR_URX_FER_EN_POS)
#define UART_CR_URX_FER_EN_UMSK                                 (~(((1U<<UART_CR_URX_FER_EN_LEN)-1)<<UART_CR_URX_FER_EN_POS))
#define UART_CR_URX_LSE_EN                                      UART_CR_URX_LSE_EN
#define UART_CR_URX_LSE_EN_POS                                  (8U)
#define UART_CR_URX_LSE_EN_LEN                                  (1U)
#define UART_CR_URX_LSE_EN_MSK                                  (((1U<<UART_CR_URX_LSE_EN_LEN)-1)<<UART_CR_URX_LSE_EN_POS)
#define UART_CR_URX_LSE_EN_UMSK                                 (~(((1U<<UART_CR_URX_LSE_EN_LEN)-1)<<UART_CR_URX_LSE_EN_POS))
#define UART_CR_URX_BCR_EN                                      UART_CR_URX_BCR_EN
#define UART_CR_URX_BCR_EN_POS                                  (9U)
#define UART_CR_URX_BCR_EN_LEN                                  (1U)
#define UART_CR_URX_BCR_EN_MSK                                  (((1U<<UART_CR_URX_BCR_EN_LEN)-1)<<UART_CR_URX_BCR_EN_POS)
#define UART_CR_URX_BCR_EN_UMSK                                 (~(((1U<<UART_CR_URX_BCR_EN_LEN)-1)<<UART_CR_URX_BCR_EN_POS))
#define UART_CR_URX_ADS_EN                                      UART_CR_URX_ADS_EN
#define UART_CR_URX_ADS_EN_POS                                  (10U)
#define UART_CR_URX_ADS_EN_LEN                                  (1U)
#define UART_CR_URX_ADS_EN_MSK                                  (((1U<<UART_CR_URX_ADS_EN_LEN)-1)<<UART_CR_URX_ADS_EN_POS)
#define UART_CR_URX_ADS_EN_UMSK                                 (~(((1U<<UART_CR_URX_ADS_EN_LEN)-1)<<UART_CR_URX_ADS_EN_POS))
#define UART_CR_URX_AD5_EN                                      UART_CR_URX_AD5_EN
#define UART_CR_URX_AD5_EN_POS                                  (11U)
#define UART_CR_URX_AD5_EN_LEN                                  (1U)
#define UART_CR_URX_AD5_EN_MSK                                  (((1U<<UART_CR_URX_AD5_EN_LEN)-1)<<UART_CR_URX_AD5_EN_POS)
#define UART_CR_URX_AD5_EN_UMSK                                 (~(((1U<<UART_CR_URX_AD5_EN_LEN)-1)<<UART_CR_URX_AD5_EN_POS))

/* 0x30 : uart_status */
#define UART_STATUS_OFFSET                                      (0x30)
#define UART_STS_UTX_BUS_BUSY                                   UART_STS_UTX_BUS_BUSY
#define UART_STS_UTX_BUS_BUSY_POS                               (0U)
#define UART_STS_UTX_BUS_BUSY_LEN                               (1U)
#define UART_STS_UTX_BUS_BUSY_MSK                               (((1U<<UART_STS_UTX_BUS_BUSY_LEN)-1)<<UART_STS_UTX_BUS_BUSY_POS)
#define UART_STS_UTX_BUS_BUSY_UMSK                              (~(((1U<<UART_STS_UTX_BUS_BUSY_LEN)-1)<<UART_STS_UTX_BUS_BUSY_POS))
#define UART_STS_URX_BUS_BUSY                                   UART_STS_URX_BUS_BUSY
#define UART_STS_URX_BUS_BUSY_POS                               (1U)
#define UART_STS_URX_BUS_BUSY_LEN                               (1U)
#define UART_STS_URX_BUS_BUSY_MSK                               (((1U<<UART_STS_URX_BUS_BUSY_LEN)-1)<<UART_STS_URX_BUS_BUSY_POS)
#define UART_STS_URX_BUS_BUSY_UMSK                              (~(((1U<<UART_STS_URX_BUS_BUSY_LEN)-1)<<UART_STS_URX_BUS_BUSY_POS))

/* 0x34 : sts_urx_abr_prd */
#define UART_STS_URX_ABR_PRD_OFFSET                             (0x34)
#define UART_STS_URX_ABR_PRD_START                              UART_STS_URX_ABR_PRD_START
#define UART_STS_URX_ABR_PRD_START_POS                          (0U)
#define UART_STS_URX_ABR_PRD_START_LEN                          (16U)
#define UART_STS_URX_ABR_PRD_START_MSK                          (((1U<<UART_STS_URX_ABR_PRD_START_LEN)-1)<<UART_STS_URX_ABR_PRD_START_POS)
#define UART_STS_URX_ABR_PRD_START_UMSK                         (~(((1U<<UART_STS_URX_ABR_PRD_START_LEN)-1)<<UART_STS_URX_ABR_PRD_START_POS))
#define UART_STS_URX_ABR_PRD_0X55                               UART_STS_URX_ABR_PRD_0X55
#define UART_STS_URX_ABR_PRD_0X55_POS                           (16U)
#define UART_STS_URX_ABR_PRD_0X55_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_0X55_MSK                           (((1U<<UART_STS_URX_ABR_PRD_0X55_LEN)-1)<<UART_STS_URX_ABR_PRD_0X55_POS)
#define UART_STS_URX_ABR_PRD_0X55_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_0X55_LEN)-1)<<UART_STS_URX_ABR_PRD_0X55_POS))

/* 0x38 : urx_abr_prd_b01 */
#define UART_URX_ABR_PRD_B01_OFFSET                             (0x38)
#define UART_STS_URX_ABR_PRD_BIT0                               UART_STS_URX_ABR_PRD_BIT0
#define UART_STS_URX_ABR_PRD_BIT0_POS                           (0U)
#define UART_STS_URX_ABR_PRD_BIT0_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT0_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT0_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT0_POS)
#define UART_STS_URX_ABR_PRD_BIT0_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT0_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT0_POS))
#define UART_STS_URX_ABR_PRD_BIT1                               UART_STS_URX_ABR_PRD_BIT1
#define UART_STS_URX_ABR_PRD_BIT1_POS                           (16U)
#define UART_STS_URX_ABR_PRD_BIT1_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT1_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT1_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT1_POS)
#define UART_STS_URX_ABR_PRD_BIT1_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT1_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT1_POS))

/* 0x3C : urx_abr_prd_b23 */
#define UART_URX_ABR_PRD_B23_OFFSET                             (0x3C)
#define UART_STS_URX_ABR_PRD_BIT2                               UART_STS_URX_ABR_PRD_BIT2
#define UART_STS_URX_ABR_PRD_BIT2_POS                           (0U)
#define UART_STS_URX_ABR_PRD_BIT2_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT2_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT2_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT2_POS)
#define UART_STS_URX_ABR_PRD_BIT2_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT2_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT2_POS))
#define UART_STS_URX_ABR_PRD_BIT3                               UART_STS_URX_ABR_PRD_BIT3
#define UART_STS_URX_ABR_PRD_BIT3_POS                           (16U)
#define UART_STS_URX_ABR_PRD_BIT3_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT3_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT3_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT3_POS)
#define UART_STS_URX_ABR_PRD_BIT3_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT3_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT3_POS))

/* 0x40 : urx_abr_prd_b45 */
#define UART_URX_ABR_PRD_B45_OFFSET                             (0x40)
#define UART_STS_URX_ABR_PRD_BIT4                               UART_STS_URX_ABR_PRD_BIT4
#define UART_STS_URX_ABR_PRD_BIT4_POS                           (0U)
#define UART_STS_URX_ABR_PRD_BIT4_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT4_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT4_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT4_POS)
#define UART_STS_URX_ABR_PRD_BIT4_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT4_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT4_POS))
#define UART_STS_URX_ABR_PRD_BIT5                               UART_STS_URX_ABR_PRD_BIT5
#define UART_STS_URX_ABR_PRD_BIT5_POS                           (16U)
#define UART_STS_URX_ABR_PRD_BIT5_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT5_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT5_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT5_POS)
#define UART_STS_URX_ABR_PRD_BIT5_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT5_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT5_POS))

/* 0x44 : urx_abr_prd_b67 */
#define UART_URX_ABR_PRD_B67_OFFSET                             (0x44)
#define UART_STS_URX_ABR_PRD_BIT6                               UART_STS_URX_ABR_PRD_BIT6
#define UART_STS_URX_ABR_PRD_BIT6_POS                           (0U)
#define UART_STS_URX_ABR_PRD_BIT6_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT6_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT6_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT6_POS)
#define UART_STS_URX_ABR_PRD_BIT6_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT6_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT6_POS))
#define UART_STS_URX_ABR_PRD_BIT7                               UART_STS_URX_ABR_PRD_BIT7
#define UART_STS_URX_ABR_PRD_BIT7_POS                           (16U)
#define UART_STS_URX_ABR_PRD_BIT7_LEN                           (10U)
#define UART_STS_URX_ABR_PRD_BIT7_MSK                           (((1U<<UART_STS_URX_ABR_PRD_BIT7_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT7_POS)
#define UART_STS_URX_ABR_PRD_BIT7_UMSK                          (~(((1U<<UART_STS_URX_ABR_PRD_BIT7_LEN)-1)<<UART_STS_URX_ABR_PRD_BIT7_POS))

/* 0x48 : urx_abr_pw_tol */
#define UART_URX_ABR_PW_TOL_OFFSET                              (0x48)
#define UART_CR_URX_ABR_PW_TOL                                  UART_CR_URX_ABR_PW_TOL
#define UART_CR_URX_ABR_PW_TOL_POS                              (0U)
#define UART_CR_URX_ABR_PW_TOL_LEN                              (8U)
#define UART_CR_URX_ABR_PW_TOL_MSK                              (((1U<<UART_CR_URX_ABR_PW_TOL_LEN)-1)<<UART_CR_URX_ABR_PW_TOL_POS)
#define UART_CR_URX_ABR_PW_TOL_UMSK                             (~(((1U<<UART_CR_URX_ABR_PW_TOL_LEN)-1)<<UART_CR_URX_ABR_PW_TOL_POS))

/* 0x50 : urx_bcr_int_cfg */
#define UART_URX_BCR_INT_CFG_OFFSET                             (0x50)
#define UART_CR_URX_BCR_VALUE                                   UART_CR_URX_BCR_VALUE
#define UART_CR_URX_BCR_VALUE_POS                               (0U)
#define UART_CR_URX_BCR_VALUE_LEN                               (16U)
#define UART_CR_URX_BCR_VALUE_MSK                               (((1U<<UART_CR_URX_BCR_VALUE_LEN)-1)<<UART_CR_URX_BCR_VALUE_POS)
#define UART_CR_URX_BCR_VALUE_UMSK                              (~(((1U<<UART_CR_URX_BCR_VALUE_LEN)-1)<<UART_CR_URX_BCR_VALUE_POS))
#define UART_STS_URX_BCR_COUNT                                  UART_STS_URX_BCR_COUNT
#define UART_STS_URX_BCR_COUNT_POS                              (16U)
#define UART_STS_URX_BCR_COUNT_LEN                              (16U)
#define UART_STS_URX_BCR_COUNT_MSK                              (((1U<<UART_STS_URX_BCR_COUNT_LEN)-1)<<UART_STS_URX_BCR_COUNT_POS)
#define UART_STS_URX_BCR_COUNT_UMSK                             (~(((1U<<UART_STS_URX_BCR_COUNT_LEN)-1)<<UART_STS_URX_BCR_COUNT_POS))

