bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/uart_reg.h
/* 0x54 : utx_rs485_cfg */
#define UART_UTX_RS485_CFG_OFFSET                               (0x54)
#define UART_CR_UTX_RS485_EN                                    UART_CR_UTX_RS485_EN
#define UART_CR_UTX_RS485_EN_POS                                (0U)
#define UART_CR_UTX_RS485_EN_LEN                                (1U)
#define UART_CR_UTX_RS485_EN_MSK                                (((1U<<UART_CR_UTX_RS485_EN_LEN)-1)<<UART_CR_UTX_RS485_EN_POS)
#define UART_CR_UTX_RS485_EN_UMSK                               (~(((1U<<UART_CR_UTX_RS485_EN_LEN)-1)<<UART_CR_UTX_RS485_EN_POS))
#define UART_CR_UTX_RS485_POL                                   UART_CR_UTX_RS485_POL
#define UART_CR_UTX_RS485_POL_POS                               (1U)
#define UART_CR_UTX_RS485_POL_LEN                               (1U)
#define UART_CR_UTX_RS485_POL_MSK                               (((1U<<UART_CR_UTX_RS485_POL_LEN)-1)<<UART_CR_UTX_RS485_POL_POS)
#define UART_CR_UTX_RS485_POL_UMSK                              (~(((1U<<UART_CR_UTX_RS485_POL_LEN)-1)<<UART_CR_UTX_RS485_POL_POS))

/* 0x80 : uart_fifo_config_0 */
#define UART_FIFO_CONFIG_0_OFFSET                               (0x80)
#define UART_DMA_TX_EN                                          UART_DMA_TX_EN
#define UART_DMA_TX_EN_POS                                      (0U)
#define UART_DMA_TX_EN_LEN                                      (1U)
#define UART_DMA_TX_EN_MSK                                      (((1U<<UART_DMA_TX_EN_LEN)-1)<<UART_DMA_TX_EN_POS)
#define UART_DMA_TX_EN_UMSK                                     (~(((1U<<UART_DMA_TX_EN_LEN)-1)<<UART_DMA_TX_EN_POS))
#define UART_DMA_RX_EN                                          UART_DMA_RX_EN
#define UART_DMA_RX_EN_POS                                      (1U)
#define UART_DMA_RX_EN_LEN                                      (1U)
#define UART_DMA_RX_EN_MSK                                      (((1U<<UART_DMA_RX_EN_LEN)-1)<<UART_DMA_RX_EN_POS)
#define UART_DMA_RX_EN_UMSK                                     (~(((1U<<UART_DMA_RX_EN_LEN)-1)<<UART_DMA_RX_EN_POS))
#define UART_TX_FIFO_CLR                                        UART_TX_FIFO_CLR
#define UART_TX_FIFO_CLR_POS                                    (2U)
#define UART_TX_FIFO_CLR_LEN                                    (1U)
#define UART_TX_FIFO_CLR_MSK                                    (((1U<<UART_TX_FIFO_CLR_LEN)-1)<<UART_TX_FIFO_CLR_POS)
#define UART_TX_FIFO_CLR_UMSK                                   (~(((1U<<UART_TX_FIFO_CLR_LEN)-1)<<UART_TX_FIFO_CLR_POS))
#define UART_RX_FIFO_CLR                                        UART_RX_FIFO_CLR
#define UART_RX_FIFO_CLR_POS                                    (3U)
#define UART_RX_FIFO_CLR_LEN                                    (1U)
#define UART_RX_FIFO_CLR_MSK                                    (((1U<<UART_RX_FIFO_CLR_LEN)-1)<<UART_RX_FIFO_CLR_POS)
#define UART_RX_FIFO_CLR_UMSK                                   (~(((1U<<UART_RX_FIFO_CLR_LEN)-1)<<UART_RX_FIFO_CLR_POS))
#define UART_TX_FIFO_OVERFLOW                                   UART_TX_FIFO_OVERFLOW
#define UART_TX_FIFO_OVERFLOW_POS                               (4U)
#define UART_TX_FIFO_OVERFLOW_LEN                               (1U)
#define UART_TX_FIFO_OVERFLOW_MSK                               (((1U<<UART_TX_FIFO_OVERFLOW_LEN)-1)<<UART_TX_FIFO_OVERFLOW_POS)
#define UART_TX_FIFO_OVERFLOW_UMSK                              (~(((1U<<UART_TX_FIFO_OVERFLOW_LEN)-1)<<UART_TX_FIFO_OVERFLOW_POS))
#define UART_TX_FIFO_UNDERFLOW                                  UART_TX_FIFO_UNDERFLOW
#define UART_TX_FIFO_UNDERFLOW_POS                              (5U)
#define UART_TX_FIFO_UNDERFLOW_LEN                              (1U)
#define UART_TX_FIFO_UNDERFLOW_MSK                              (((1U<<UART_TX_FIFO_UNDERFLOW_LEN)-1)<<UART_TX_FIFO_UNDERFLOW_POS)
#define UART_TX_FIFO_UNDERFLOW_UMSK                             (~(((1U<<UART_TX_FIFO_UNDERFLOW_LEN)-1)<<UART_TX_FIFO_UNDERFLOW_POS))
#define UART_RX_FIFO_OVERFLOW                                   UART_RX_FIFO_OVERFLOW
#define UART_RX_FIFO_OVERFLOW_POS                               (6U)
#define UART_RX_FIFO_OVERFLOW_LEN                               (1U)
#define UART_RX_FIFO_OVERFLOW_MSK                               (((1U<<UART_RX_FIFO_OVERFLOW_LEN)-1)<<UART_RX_FIFO_OVERFLOW_POS)
#define UART_RX_FIFO_OVERFLOW_UMSK                              (~(((1U<<UART_RX_FIFO_OVERFLOW_LEN)-1)<<UART_RX_FIFO_OVERFLOW_POS))
#define UART_RX_FIFO_UNDERFLOW                                  UART_RX_FIFO_UNDERFLOW
#define UART_RX_FIFO_UNDERFLOW_POS                              (7U)
#define UART_RX_FIFO_UNDERFLOW_LEN                              (1U)
#define UART_RX_FIFO_UNDERFLOW_MSK                              (((1U<<UART_RX_FIFO_UNDERFLOW_LEN)-1)<<UART_RX_FIFO_UNDERFLOW_POS)
#define UART_RX_FIFO_UNDERFLOW_UMSK                             (~(((1U<<UART_RX_FIFO_UNDERFLOW_LEN)-1)<<UART_RX_FIFO_UNDERFLOW_POS))

/* 0x84 : uart_fifo_config_1 */
#define UART_FIFO_CONFIG_1_OFFSET                               (0x84)
#define UART_TX_FIFO_CNT                                        UART_TX_FIFO_CNT
#define UART_TX_FIFO_CNT_POS                                    (0U)
#define UART_TX_FIFO_CNT_LEN                                    (5U)
#define UART_TX_FIFO_CNT_MSK                                    (((1U<<UART_TX_FIFO_CNT_LEN)-1)<<UART_TX_FIFO_CNT_POS)
#define UART_TX_FIFO_CNT_UMSK                                   (~(((1U<<UART_TX_FIFO_CNT_LEN)-1)<<UART_TX_FIFO_CNT_POS))
#define UART_RX_FIFO_CNT                                        UART_RX_FIFO_CNT
#define UART_RX_FIFO_CNT_POS                                    (8U)
#define UART_RX_FIFO_CNT_LEN                                    (5U)
#define UART_RX_FIFO_CNT_MSK                                    (((1U<<UART_RX_FIFO_CNT_LEN)-1)<<UART_RX_FIFO_CNT_POS)
#define UART_RX_FIFO_CNT_UMSK                                   (~(((1U<<UART_RX_FIFO_CNT_LEN)-1)<<UART_RX_FIFO_CNT_POS))
#define UART_TX_FIFO_TH                                         UART_TX_FIFO_TH
#define UART_TX_FIFO_TH_POS                                     (16U)
#define UART_TX_FIFO_TH_LEN                                     (4U)
#define UART_TX_FIFO_TH_MSK                                     (((1U<<UART_TX_FIFO_TH_LEN)-1)<<UART_TX_FIFO_TH_POS)
#define UART_TX_FIFO_TH_UMSK                                    (~(((1U<<UART_TX_FIFO_TH_LEN)-1)<<UART_TX_FIFO_TH_POS))
#define UART_RX_FIFO_TH                                         UART_RX_FIFO_TH
#define UART_RX_FIFO_TH_POS                                     (24U)
#define UART_RX_FIFO_TH_LEN                                     (4U)
#define UART_RX_FIFO_TH_MSK                                     (((1U<<UART_RX_FIFO_TH_LEN)-1)<<UART_RX_FIFO_TH_POS)
#define UART_RX_FIFO_TH_UMSK                                    (~(((1U<<UART_RX_FIFO_TH_LEN)-1)<<UART_RX_FIFO_TH_POS))

