bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/uart_reg.h
    /* 0x28 : UART interrupt clear */
    union {
        struct {
            uint32_t cr_utx_end_clr                 :  1; /* [    0],        w1c,        0x0 */
            uint32_t cr_urx_end_clr                 :  1; /* [    1],        w1c,        0x0 */
            uint32_t rsvd_2                         :  1; /* [    2],       rsvd,        0x0 */
            uint32_t rsvd_3                         :  1; /* [    3],       rsvd,        0x0 */
            uint32_t cr_urx_rto_clr                 :  1; /* [    4],        w1c,        0x0 */
            uint32_t cr_urx_pce_clr                 :  1; /* [    5],        w1c,        0x0 */
            uint32_t rsvd_6                         :  1; /* [    6],       rsvd,        0x0 */
            uint32_t rsvd_7                         :  1; /* [    7],       rsvd,        0x0 */
            uint32_t cr_urx_lse_clr                 :  1; /* [    8],        w1c,        0x0 */
            uint32_t cr_urx_bcr_clr                 :  1; /* [    9],        w1c,        0x0 */
            uint32_t cr_urx_ads_clr                 :  1; /* [   10],        w1c,        0x0 */
            uint32_t cr_urx_ad5_clr                 :  1; /* [   11],        w1c,        0x0 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } uart_int_clear;

    /* 0x2C : UART interrupt enable */
    union {
        struct {
            uint32_t cr_utx_end_en                  :  1; /* [    0],        r/w,        0x1 */
            uint32_t cr_urx_end_en                  :  1; /* [    1],        r/w,        0x1 */
            uint32_t cr_utx_frdy_en                 :  1; /* [    2],        r/w,        0x1 */
            uint32_t cr_urx_frdy_en                 :  1; /* [    3],        r/w,        0x1 */
            uint32_t cr_urx_rto_en                  :  1; /* [    4],        r/w,        0x1 */
            uint32_t cr_urx_pce_en                  :  1; /* [    5],        r/w,        0x1 */
            uint32_t cr_utx_fer_en                  :  1; /* [    6],        r/w,        0x1 */
            uint32_t cr_urx_fer_en                  :  1; /* [    7],        r/w,        0x1 */
            uint32_t cr_urx_lse_en                  :  1; /* [    8],        r/w,        0x1 */
            uint32_t cr_urx_bcr_en                  :  1; /* [    9],        r/w,        0x1 */
            uint32_t cr_urx_ads_en                  :  1; /* [   10],        r/w,        0x1 */
            uint32_t cr_urx_ad5_en                  :  1; /* [   11],        r/w,        0x1 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } uart_int_en;

    /* 0x30 : uart_status */
    union {
        struct {
            uint32_t sts_utx_bus_busy               :  1; /* [    0],          r,        0x0 */
            uint32_t sts_urx_bus_busy               :  1; /* [    1],          r,        0x0 */
            uint32_t reserved_2_31                  : 30; /* [31: 2],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } uart_status;

    /* 0x34 : sts_urx_abr_prd */
    union {
        struct {
            uint32_t sts_urx_abr_prd_start          : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_0x55           : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sts_urx_abr_prd;

    /* 0x38 : urx_abr_prd_b01 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit0           : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t sts_urx_abr_prd_bit1           : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } urx_abr_prd_b01;

    /* 0x3C : urx_abr_prd_b23 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit2           : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t sts_urx_abr_prd_bit3           : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } urx_abr_prd_b23;

    /* 0x40 : urx_abr_prd_b45 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit4           : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t sts_urx_abr_prd_bit5           : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } urx_abr_prd_b45;

    /* 0x44 : urx_abr_prd_b67 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit6           : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t sts_urx_abr_prd_bit7           : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } urx_abr_prd_b67;

    /* 0x48 : urx_abr_pw_tol */
    union {
        struct {
            uint32_t cr_urx_abr_pw_tol              :  8; /* [ 7: 0],        r/w,        0x3 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } urx_abr_pw_tol;

